# Remove Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeTable..::..Remove Method
ExportLinetypeTable Class See Also
---
Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Remove(
	ExportLinetypeKey exportLinetypeKey
)
```

Visual Basic
---
```text
Public Sub Remove ( _
	exportLinetypeKey As ExportLinetypeKey _
)
```

Visual C++
---
```text
public:
void Remove(
	ExportLinetypeKey^ exportLinetypeKey
)
```

# ### Parameters
exportLinetypeKey
    Type: Autodesk.Revit.DB..::..ExportLinetypeKey The export line type key
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace